---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarCouplerError.VaryingDistanceBetweenDistributionsBars
enum: Autodesk.Revit.DB.Structure.RebarCouplerError
source: html/36b8947f-6ee1-8f70-f2fc-ab52dd1afd90.htm
---
# Autodesk.Revit.DB.Structure.RebarCouplerError.VaryingDistanceBetweenDistributionsBars

All the bars from the selected sets, which need to be connected, must be separated by the same distance.